emacs.org
#+title: Emacs Configuration

* Early Init
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./early-init.el
:END:

** Native and byte compilation
:PROPERTIES:
:CREDITS:  https://github.com/jamescherti/minimal-emacs.d/blob/9fdfca3265246341ab63fe790b99bd4a2f3cca6d/early-init.el#L217
:END:

If Emacs is built with native compilation support, activate it¹, if not, disable it².

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp

  ;; 1
  (if (and (featurep #'native-compile)
           (fboundp #'native-comp-available-p)
           (native-comp-available-p))
      (setq native-comp-jit-compilation t
            package-native-compile t)
    ;; 2
    (setq features (delq #'native-compile features)))

  ;; Disable package initialization on startup
  ;; packages are only used in the modules.
  (setq package-enable-at-startup nil)

#+end_src

** [[https://github.com/emacscollective/no-littering?tab=readme-ov-file#native-compilation-cache][Native Compilation Cache]]

Moves the Native Compilation Cache folder out of the Emacs base folder.

#+begin_src emacs-lisp

  (when (fboundp #'startup-redirect-eln-cache)
    (startup-redirect-eln-cache
     (convert-standard-filename
      (expand-file-name  "var/eln-cache/" user-emacs-directory))))

#+end_src

** Directory Variables

Variables used to reference to specific directories, using ~convert-standard-filename~ for multiple OS support.

#+begin_src emacs-lisp

  (defcustom gs-101/projects-code-directory (convert-standard-filename (expand-file-name "~/Projects/Code/"))
    "Path for project related to code, like applications."
    :type 'directory
    )
  (defcustom gs-101/modules-directory (convert-standard-filename (expand-file-name "modules" user-emacs-directory))
    "Path for this configuration's modules."
    :type 'directory
    )

#+end_src

** Helpers

#+begin_src emacs-lisp

  (defun gs-101/guix-p ()
    "Check if guix is installed in the current system."
    (executable-find "guix"))

  (defun gs-101/nobara-p ()
    "Check if the current system uses Nobara Linux as its distribution."
    (executable-find "nobara-welcome"))

#+end_src

* Load Modules
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./init.el
:END:

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp

  (add-to-list 'load-path (expand-file-name gs-101/modules-directory))

  (require 'gs-package)
  (require 'gs-settings)
  (require 'gs-fm)
  (require 'gs-keys)
  (require 'gs-org)
  (require 'gs-org-roam)
  (require 'gs-citar)
  (require 'gs-dev)
  (require 'gs-completion)
  (require 'gs-utils)
  (require 'gs-chat)
  (require 'gs-elfeed)
  ;;(require 'gs-keys-evil)
  ;;(require 'gs-keys-meow)
  (require 'gs-ui)

#+end_src

* Package System Set-up
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :link yes :tangle ./modules/gs-package.el
:CREDITS:  https://github.com/jamescherti/minimal-emacs.d/blob/9fdfca3265246341ab63fe790b99bd4a2f3cca6d/early-init.el#L217
:END:

** Package

#+begin_quote

Simple package system [...].

#+end_quote

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp

  (require 'package)
  (package-initialize)
  (mapc (lambda (archive)
          (add-to-list 'package-archives archive)) '(
          ("melpa" . "https://melpa.org/packages/")
          ("jcs-elpa" . "https://jcs-emacs.github.io/jcs-elpa/packages/")
          ))

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'gs-package)
#+end_src

* Settings
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-settings.el
:END:

Configuration of default Emacs packages.

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** Default packages

*** Advice

#+begin_quote

An overloading mechanism for Emacs Lisp functions.

#+end_quote

#+begin_src emacs-lisp

  (use-package advice
    :custom
    (ad-redefinition-action 'accept)
    )

#+end_src

*** Byte Compilation

#+begin_quote

The Emacs Lisp byte compiler. This crunches Lisp source into a sort of p-code (~lapcode~) which takes up less space and can be interpreted faster.

#+end_quote

#+begin_src emacs-lisp

  (use-package bytecomp
    :custom
    (byte-compile-warnings '(not obsolete))
    )

#+end_src

*** Byte Compilation

#+begin_quote

This file contains all the code needed to drive async compilations and any Lisp code needed at runtime to run native code.

#+end_quote

#+begin_src emacs-lisp

  (use-package comp-run
    :custom
    (native-comp-async-query-on-exit t)
    (native-comp-async-report-warnings-errors 'silent)
    )

#+end_src

*** Ediff Window

#+begin_quote

window manipulation utilities.

#+end_quote

#+begin_src emacs-lisp

  (use-package ediff-wind
    :custom
    (ediff-window-setup-function 'ediff-setup-windows-plain)
    )

#+end_src

*** Emacs
:PROPERTIES:
:CREDITS:  1. [[https://codeberg.org/ashton314/emacs-bedrock/src/branch/main/early-init.el][ashton]], 2. [[https://github.com/gopar/.emacs.d/blob/main/README.org#recommended-packagessnippets-to-have-as-early-as-possible][gopar]], 3. [[https://github.com/jamescherti/minimal-emacs.d/blob/837e3d46acfe5a6c385b4ae253b9549d89ece1cf/early-init.el#][jamescherti]], 4. [[https://github.com/minad/vertico?tab=readme-ov-file#configuration][minad]], 5. [[https://github.com/oantolin/emacs-config/tree/master][oantolin]]
:END:

Generic package used to configure functions and variables not included in any Emacs Lisp files. This is mainly used for files defied in C code.

#+begin_src emacs-lisp

  (use-package emacs
    :config
    (setq define-coding-system-alias '(UTF-8 'utf-8))
    :custom
    (auto-save-include-big-deletions)
    (auto-window-vscroll nil) ;; 3
    (bidi-inhibit-bpa t) ;; 3
    (completion-ignore-case t) ;; 4
    (cursor-in-non-selected-windows nil) ;; 3
    (debugger-stack-frame-as-list t) ;; 5
    (enable-recursive-minibuffers t)
    (fast-but-imprecise-scrolling t) ;; 3
    (frame-resize-pixelwise t) ;; 1
    (history-delete-duplicates t) ;; 5
    (hscroll-margin 2) ;; 3
    (hscroll-step 1) ;; 3
    (inhibit-compacting-font-caches t) ;; 3
    (load-prefer-newer t) ;; 2
    (locale-coding-system 'utf-8)
    ;; Disable the cursor in the minibuffer prompt
    (minibuffer-prompt-properties '(
                                    cursor-intangible t
                                    read-only t
                                    face minibuffer-prompt
                                    )) ;; 4
    (read-buffer-completion-ignore-case t) ;; 4
    (read-process-output-max (* 512 1024)) ;; 3
    (resize-mini-windows 'grow-only)
    (scroll-conservatively 100000)
    (scroll-margin 2)
    (scroll-step 1)
    (tab-width 4)
    (text-mode-ispell-word-completion nil)
    (user-full-name "Gabriel Santos")
    (window-resize-pixelwise nil) ;; 1
    (words-include-escapes t)
    :hook
    (minibuffer-setup . cursor-intangible-mode) ;; 4
    )

#+end_src

*** EPG Configuration

#+begin_quote

Configuration of the EasyPG Library.

#+end_quote

#+begin_src emacs-lisp

  (use-package epg-config
    :custom
    (epg-pinentry-mode 'loopback)
    )

#+end_src

#+begin_src conf-unix :results none :mkdirp yes :tangle ~/.gnupg/gpg-agent.conf
  allow-emacs-pinentry
  allow-loopback-pinentry
#+end_src

*** Files
:PROPERTIES:
:CREDITS:  1. [[https://github.com/jamescherti/minimal-emacs.d/blob/837e3d46acfe5a6c385b4ae253b9549d89ece1cf/early-init.el#L178][jamescherti]], 2. [[https://github.com/Nathan-Furnal/dotemacs/blob/45defa98dfa7a7c401ca692e9479e588896b9261/init.el#L226][nathan-furnal]], 3. [[https://github.com/oantolin/emacs-config/tree/master][oantolin]], 4. [[https://github.com/xenodium/dotsies/blob/main/emacs/features/fe-files.el][xenodium]]
:END:

#+begin_quote

Defines most of Emacs's file- and directory-handling functions, including basic file visiting, backup generation, link handling, ITS-id version control, load- and write-hook handling, and the like.

#+end_quote

#+begin_src emacs-lisp

  (use-package files
    :config
    (add-hook 'after-save-hook #'executable-make-buffer-file-executable-if-script-p) ;; 3
    (add-to-list 'find-file-not-found-functions #'xenodium/files-create-non-existent-directory) ;; 4
    :custom
    (auto-mode-case-fold nil)
    (backup-by-copying t) ;; 2
    (backup-by-copying-when-linked t) ;; 2
    (delete-old-versions t)
    (find-file-suppress-same-file-warnings t)
    (find-file-visit-truename t)
    (kept-new-versions 5) ;; 2
    (kept-old-versions 5) ;; 2
    (revert-without-query '("")) ;; 3
    (trusted-content '(
                       (package-user-dir)
                       (gs-101/modules-directory)
                       (gs-101/projects-code-directory)
                       ))
    (version-control t) ;; 2
    (view-read-only t) ;; 3
    :preface
    (defun xenodium/files-create-non-existent-directory ()
      "Create a non-existent directory."
      (when-let* ((file-name buffer-file-name)
                  (parent-directory (file-name-parent-directory file-name)))
        (when (and (not (file-exists-p parent-directory))
                   (y-or-n-p (format "Create `%s' dir? " parent-directory)))
          (make-directory parent-directory t))))
    )

#+end_src

*** Frame

#+begin_quote

Multi-frame management independent of window systems.

#+end_quote

This is just to remove the =suspend-frame= command, which I don't find useful. This liberates =C-z= to have it used as a prefix.

#+begin_src emacs-lisp

  (use-package frame
    :bind
    ("C-z" . nil)
    )

#+end_src

*** grep

#+begin_quote
run `grep' and display the results.
#+end_quote

#+begin_src emacs-lisp

  (use-package grep
    :custom
    (grep-use-headings t)
    )

#+end_src

*** Help

#+begin_quote

Help commands for Emacs.

#+end_quote

#+begin_src emacs-lisp

  (use-package help
    :custom
    (help-window-select t)
    )

#+end_src

*** [[https://github.com/kickingvegas/casual-ibuffer?tab=readme-ov-file#configuration][iBuffer Extensions]]

#+begin_quote

Extensions for iBuffer.

#+end_quote

#+begin_src emacs-lisp

  (use-package ibuf-ext
    :defer t
    :hook
    (ibuffer-mode . ibuffer-auto-mode)
    )

#+end_src

*** Image Mode
:PROPERTIES:
:CREDITS:  https://codeberg.org/zyd/dotfiles/src/commit/e2deef9551ec259e62e19abe3a9b86feb4a5c870/emacs.d/init.el#L904
:END:

#+begin_quote

Support for visiting image files.

#+end_quote

#+begin_src emacs-lisp

  (use-package image-mode
    :after dired
    :custom
    (image-animate-loop t)
    )

#+end_src

*** iMenu

#+begin_quote

Purpose of this package:

- To present a framework for mode-specific buffer indexes;
- A buffer index is an alist of names and buffer positions.

#+end_quote

#+begin_src emacs-lisp

  (use-package imenu
    :custom
    (imenu-flatten 'annotation)
    (imenu-space-replacement nil)
    )

#+end_src

*** Indent

#+begin_quote

Commands for making and changing indentation in text. These are described in the Emacs manual.

#+end_quote

#+begin_src emacs-lisp

  (use-package indent
    :custom
    (tab-always-indent 'complete)
    :defer t
    )

#+end_src

*** iSearch

#+begin_quote

Incremental search minor mode.

#+end_quote

#+begin_src emacs-lisp

  (use-package isearch
    :custom
    (isearch-allow-scroll t)
    (isearch-lazy-count t)
    (lazy-count-prefix-format "(%s/%s) ")
    (lazy-count-suffix-format nil)
    (lazy-highlight-initial-delay 0.0)
    )

#+end_src

*** Minibuffer
:PROPERTIES:
:CREDITS:  1. [[https://codeberg.org/ashton314/emacs-bedrock/src/commit/f17a4b4d5116ac7eec3b30a0d43fa46eb074da0b/init.el#L107][ashton314]], 2. [[https://github.com/minad/vertico?tab=readme-ov-file#completion-styles-and-tab-completion][minad]]
:END:

#+begin_src emacs-lisp

  (use-package minibuffer
    :custom
    (completions-detailed t) ;; 1
    (completions-format 'vertical)
    (completions-group t) ;; 1
    (read-file-name-completion-ignore-case t) ;; 2
    (resize-mini-windows t)
    :init
    (minibuffer-depth-indicate-mode)
    (minibuffer-electric-default-mode)
    )

#+end_src

*** Mode Local

#+begin_quote

There are buffer local variables (and there were frame local variables). This library gives the illusion of mode specific variables.

#+end_quote

#+begin_src emacs-lisp

  (use-package mode-local
    )

#+end_src

*** Mouse

#+begin_quote

This package provides various useful commands (including help system access) through the mouse.  All this code assumes that mouse interpretation has been abstracted into Emacs input events.

#+end_quote

#+begin_src emacs-lisp

  (use-package mouse
    :custom
    (mouse-yank-at-point t)
    )

#+end_src

*** Mule

Multilingual Enviroment.

#+begin_src emacs-lisp

  (use-package mule
    :config
    (set-keyboard-coding-system 'utf-8)
    (set-selection-coding-system 'utf-8)
    (set-terminal-coding-system 'utf-8)
    :defer t
    )

#+end_src

**** Cmds
:PROPERTIES:
:CREDITS:  1. [[https://github.com/jamescherti/minimal-emacs.d/blob/837e3d46acfe5a6c385b4ae253b9549d89ece1cf/early-init.el#L65][jamescherti]], 2. [[https://github.com/oantolin/emacs-config/blob/master/init.el][oantolin]]
:END:

#+begin_quote

Commands for Multilingual Enviroment.

#+end_quote

#+begin_src emacs-lisp

  (use-package mule-cmds
    :config
    (set-language-environment 'utf-8)
    (prefer-coding-system 'utf-8)
    :custom
    (current-language-environment "UTF-8") ;; 2
    (default-input-method nil) ;; 1
    :defer t
    )

#+end_src

**** Util

#+begin_quote

Utility functions for Multilingual Enviroment.

#+end_quote

#+begin_src emacs-lisp

  (use-package mule-util
    :custom
    (truncate-string-ellipsis "…")
    )

#+end_src

*** New Comment

#+begin_quote

(un)comment regions of buffers.

#+end_quote

#+begin_src emacs-lisp

  (use-package newcomment
    :custom
    (comment-empty-lines t)
    )

#+end_src

*** Paren

#+begin_quote

Highlight matching paren.

#+end_quote

#+begin_src emacs-lisp

  (use-package paren
    :config
    (set-face-attribute 'show-paren-match nil :foreground 'unspecified :box '(:line-width (-1 . -1)))
    :custom
    (show-paren-delay 0)
    :init
    (show-paren-mode)
    )

#+end_src

*** Password

**** Cache

#+begin_quote

Read passwords, possibly using a password cache.

#+end_quote

#+begin_src emacs-lisp

  (use-package password-cache
    :custom
    (password-cache-expiry 60)
    )

#+end_src

*** Save History

#+begin_quote

Save minibuffer history.

#+end_quote

#+begin_src emacs-lisp

  (use-package savehist
    :custom
    (history-length 300)
    :init
    (savehist-mode)
    )

#+end_src

*** Send Mail

#+begin_quote

This mode provides mail-sending facilities from within Emacs.

#+end_quote

#+begin_src emacs-lisp

  (use-package sendmail
    :custom
    (sendmail-program "msmtp")
    :defer t
    )

#+end_src

