emacs.org
** Roam Agenda
:PROPERTIES:
:CREDITS:  https://github.com/daviwil/dotfiles/blob/master/.emacs.d/modules/dw-workflow.el, 1. https://github.com/org-roam/org-roam/issues/2357#issuecomment-1614254880
:END:


#+begin_src emacs-lisp

  (use-package org-agenda
    :bind
    ("C-z r b" . dw/org-roam-capture-inbox)
    :preface
    (defun dw/org-roam-filter-by-tag (tag-name)
      "Filter org roam files by their tags."
      (lambda (node)
        (member tag-name (org-roam-node-tags node))))

    (defun dw/org-roam-list-notes-by-tag (tag-name)
      "List org roam files by their tags."
      (mapcar #'org-roam-node-file
              (seq-filter
               (dw/org-roam-filter-by-tag tag-name)
               (org-roam-node-list))))

    (defun dw/org-roam-refresh-agenda-list () ;; 1
      "Refresh the current agenda list, and add the files with the currosponding tag to the agenda list."
      (interactive)
      (setq org-agenda-files (dw/org-roam-list-notes-by-tag "agenda")))
    ;; Build the agenda list the first time for the session
    (dw/org-roam-refresh-agenda-list)
    (defun dw/org-roam-project-finalize-hook ()
      "Adds the captured project file to "org-agenda-file" if the capture was not aborted."
      ;; Remove the hook since it was added temporarily
      (remove-hook 'org-capture-after-finalize-hook #'dw/org-roam-project-finalize-hook)

      ;; Add project file to the agenda list if the capture was confirmed
      (unless org-note-abort
        (with-current-buffer (org-capture-get :buffer)
          (add-to-list 'org-agenda-files (buffer-file-name)))))
    (defun dw/org-roam-capture-inbox ()
      "Create a org roam inbox file."
      (interactive)
      (org-roam-capture- :node (org-roam-node-create)
                         :templates '(("i" "inbox" plain "* %?"
                                       :if-new (file+head "inbox.org" "#+title: Inbox\n#+filetags: :agenda:\n\n")))))
    (defun dw/org-roam-goto-month ()
      "Lists the files of the selected month with the set tag."
      (interactive)
      (org-roam-capture- :goto (when (org-roam-node-from-title-or-alias (format-time-string "%Y-%B")) '(4))
                         :node (org-roam-node-create)
                         :templates '(("m" "month" plain "\n* Goals\n\n%?* Summary\n\n"
                                       :if-new (file+head "%<%Y-%B>.org"
                                                          "#+title: %<%Y-%B>\n#+filetags: :agenda:\n\n")
                                       :unnarrowed t))))
    (defun dw/org-roam-goto-year ()
      "Lists the files of the selected year with the set tag."
      (interactive)
      (org-roam-capture- :goto (when (org-roam-node-from-title-or-alias (format-time-string "%Y")) '(4))
                         :node (org-roam-node-create)
                         :templates '(("y" "year" plain "\n* Goals\n\n%?* Summary\n\n"
                                       :if-new (file+head "%<%Y>.org"
                                                          "#+title: %<%Y>\n#+filetags: :agenda:\n\n")
                                       :unnarrowed t))))
    :custom
    (org-agenda-hide-tags-regexp "agenda")
    :hook
    (org-agenda-finalize . dw/org-roam-refresh-agenda-list)
    )

#+end_src

** [[https://github.com/org-roam/org-roam-ui][User Interface]]

#+begin_quote

A graphical frontend for exploring your org-roam Zettelkasten.

#+end_quote

#+begin_src emacs-lisp

  (use-package org-roam-ui
    :vc (:url "https://github.com/org-roam/org-roam-ui")
    :bind
    ("C-z r u" . org-roam-ui-open)
    :custom
    (org-roam-ui-sync-theme t)
    (org-roam-ui-follow t)
    (org-roam-ui-update-on-save t)
    (org-roam-ui-open-on-start nil)
    (org-roam-ui-browser-function #'browse-url-chromium)
    :ensure t
    )

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'gs-org-roam)
#+end_src

* [[https://github.com/emacs-citar/citar][Citar]]
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-citar.el
:END:

#+begin_quote

Emacs package to quickly find and act on bibliographic references, and edit org, markdown, and latex academic documents.

#+end_quote

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp

  (use-package citar
    :vc (:url "https://github.com/emacs-citar/citar")
    :custom
    (citar-bibliography "~/Documents/Bibliography.bib")
    (citar-citeproc-csl-styles-dir "~/Documents/Zotero/styles/")
    (citar-citeproc-csl-style "harvard-cite-them-right.csl")
    (citar-format-reference-function #'citar-citeproc-format-reference)
    (citar-library-paths '("~/Documents/Zotero/storage/"))
    (citar-open-entry-function #'citar-open-entry-in-zotero)
    (citar-templates '((main . "${author editor:30%sn}     ${date year issued:4}     ${title:48}") (suffix . "          ${=key= id:15}    ${tags keywords keywords:*}    ${abstract abstract:*}") (preview . "${author editor:%etal} (${year issued date}) ${title}, ${journal journaltitle publisher container-title collection-title}.
  ") (note . "Notes on ${author editor:%etal}, ${title}")))
    :hook
    (org-mode . citar-capf-setup)
    :ensure t
    )

#+end_src

** [[https://github.com/emacs-citar/citar?tab=readme-ov-file#embark][Embark]]

#+begin_src emacs-lisp

  (use-package citar-embark
    :after embark
    :custom
    (citar-at-point-function #'embark-act)
    :hook
    (text-mode . citar-embark-mode)
    )

#+end_src

**** [[https://github.com/emacs-citar/citar/wiki/Embark][More Functions]]

#+begin_src emacs-lisp

  (use-package citar-embark
    :after citar-embark
    :config
    (setf (alist-get
           'key-at-point
           (alist-get '(org-mode) citar-major-mode-functions nil nil #'equal))
          #'bdarcus/citar-org-key-at-point)

    (defun bdarcus/citar-org-key-at-point ()
      "Return citekey at point, when in org property drawer.

  Citekey must be formatted as `@key'."
      (or (citar-org-key-at-point)
          (when (and (equal (org-element-type (org-element-at-point)) 'node-property)
                     (org-in-regexp (concat "[[:space:]]" org-element-citation-key-re)))
            (cons (substring (match-string 0) 2)
                  (cons (match-beginning 0)
                        (match-end 0))))))
    (add-to-list 'embark-keymap-alist '(bib-reference . citar-map))
    )

#+end_src

** Org Cite

#+begin_src emacs-lisp

  (use-package oc
    :bind
    (
     :map org-mode-map
     ("C-c m q" . org-cite-insert)
     )
    :custom
    (org-cite-global-bibliography '("~/Documents/Bibliography.bib"))
    (org-cite-insert-processor 'citar)
    (org-cite-follow-processor 'citar)
    (org-cite-activate-processor 'citar)
    )

#+end_src

*** CSL

#+begin_src emacs-lisp

  (use-package oc-csl
    :after oc
    :custom
    (org-cite-csl-styles-dir "~/Documents/Zotero/styles/")
    (org-cite-export-processors '((t . (csl "harvard-cite-them-right.csl"))))
    )

#+end_src

** [[https://github.com/emacs-citar/citar-org-roam][Org Roam]]

#+begin_src emacs-lisp

  (use-package citar-org-roam
    :vc (:url "https://github.com/emacs-citar/citar-org-roam")
    :bind
    ("C-z r c" . citar-create-note)
    :after org-roam
    :config
    (citar-org-roam-mode)
    (add-to-list 'org-roam-capture-templates
                 '("b" "bibliographic" plain
                  (file "~/Documents/Org Roam/Templates/default.org")
                  :if-new
                  (file+head "%<%Y%m%d%H%M%S>-${citar-citekey}.org" "#+title: ${title}\n\n")
                  :unnarrowed t))
    :custom
    (citar-org-roam-capture-template-key "b")
    (citar-org-roam-note-title-template "${title}")
    :ensure t
    )

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'gs-citar)
#+end_src

* Development
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-dev.el
:END:

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** Tree-Sitter

#+begin_quote

tree-sitter utilities.

#+end_quote

#+begin_src emacs-lisp

  (use-package treesit
    :custom
    (treesit-font-lock-level 4)
    )

#+end_src

*** Org Source

#+begin_quote

Source code examples in Org.

#+end_quote

#+begin_src emacs-lisp

  (use-package org-src
    :config
    (mapc (lambda (lang)
            (add-to-list 'org-src-lang-modes lang)) '(
            ("bash" . bash-ts)
            ("C" . c-ts)
            ("clojure" . clojure-ts)
            ("cmake" . cmake-ts)
            ("csharp" . csharp-ts)
            ("css" . css-ts)
            ("dart" . dart-ts)
            ("go" . go-ts)
            ("html" . html-ts)
            ("java" . java-ts)
            ("js" . js-ts)
            ("json" . json-ts)
            ("python" . python-ts)
            ("ruby" . ruby-ts)
            ("rust" . rust-ts)
            ("toml" . toml-ts)
            ("yaml" . yaml-ts)
            ))
    )
#+end_src

*** [[https://github.com/renzmann/treesit-auto][Auto]]

#+begin_quote

Automatic installation, usage, and fallback for tree-sitter major modes in Emacs 29.

#+end_quote

#+begin_src emacs-lisp

  (use-package treesit-auto
    :vc (:url "https://github.com/gs-101/treesit-auto" :branch custom)
    :config
    (global-treesit-auto-mode)
    (treesit-auto-add-to-auto-mode-alist 'all)
    :custom
    (treesit-auto-install t)
    :ensure t
    )

#+end_src

*** [[https://github.com/danilshvalov/git-commit-ts-mode][git-commit]]

#+begin_src emacs-lisp

  (use-package git-commit-ts-mode
    :vc (:url "https://github.com/danilshvalov/git-commit-ts-mode")
    :ensure t
    )

#+end_src

**** [[https://github.com/danilshvalov/git-commit-ts-mode?tab=readme-ov-file#magit-integration][Magit]]

#+begin_src emacs-lisp

  (use-package magit
    :after git-commit-ts-mode magit
    :custom
    (git-commit-major-mode 'git-commit-ts-mode)
    )

#+end_src

** Compile

#+begin_quote

Run compiler as inferior of Emacs, parse error messages.

#+end_quote

#+begin_src emacs-lisp

  (use-package compile
    :bind
    (
     :map compilation-mode-map
     ("n" . next-error-no-select)
     ("p" . previous-error-no-select)
     ("q" . kill-buffer-and-window)
     )
    :custom
    (compilation-auto-jump-to-first-error t)
    (compilation-max-output-line-length nil)
    (compilation-scroll-output t)
    (compilation-skip-threshold 2)
    :defer t
    :hook
    (compilation-mode . goto-address-mode)
    (compilation-filter . ansi-color-compilation-filter)
    )

#+end_src

*** Compilers

**** Cargo

#+begin_src emacs-lisp

  (use-package compile
    :after rust-ts-mode
    :config
    (push '(cargo "^\\ \\ -->\\ \\([/a-z_\\.]+\\):\\([0-9]+\\):\\([0-9]+\\)" 1 2 3)
          compilation-error-regexp-alist-alist)
    (push 'cargo compilation-error-regexp-alist)
    )

#+end_src

*** [[https://github.com/mohkale/compile-multi][multi]]

#+begin_quote

Multi target interface to compile.

#+end_quote

#+begin_src emacs-lisp

  (use-package compile-multi
    :bind
    ([remap compile] . compile-multi)
    :ensure t
    )

#+end_src
    
**** [[https://github.com/mohkale/compile-multi?tab=readme-ov-file#consult-multi-compile][Consult]]

#+begin_src emacs-lisp

  (use-package consult-compile-multi
    :after compile-multi consult
    :ensure t
    :config
    (consult-compile-multi-mode)
    )

#+end_src

**** [[https://github.com/mohkale/compile-multi?tab=readme-ov-file#compile-multi-embark][Embark]]

#+begin_src emacs-lisp

  (use-package compile-multi-embark
    :after compile-multi embark
    :ensure t
    :config
    (compile-multi-embark-mode)
    )

#+end_src

** Diff

#+begin_quote

Provides support for font-lock, outline, navigation commands, editing and various conversions as well as jumping to the corresponding source file.

#+end_quote

#+begin_src emacs-lisp

  (use-package diff-mode
    :custom
    (diff-add-log-use-relative-names t)
    :defer t
    )

#+end_src

** Eglot

#+begin_quote

Eglot ("Emacs Polyglot") is an Emacs LSP client that stays out of your way.

#+end_quote

#+begin_src emacs-lisp

  (use-package eglot
    :custom
    (eglot-autoshutdown t)
    (eglot-connect-timeout nil)
    (eglot-sync-connect nil)
    :defer t
    )

#+end_src

*** [[https://github.com/jdtsmith/eglot-booster][Booster]]

#+begin_quote

Boost eglot using lsp-booster.

#+end_quote

#+begin_src emacs-lisp

  (use-package eglot-booster
    :vc (:url "https://github.com/jdtsmith/eglot-booster")
    :ensure t
    :hook
    (eglot-managed-mode . eglot-booster-mode)
    )

#+end_src

