emacs.org
** [[https://github.com/oantolin/embark][Embark]]

#+begin_quote

Emacs Mini-Buffer Actions Rooted in Keymaps.

#+end_quote

#+begin_src emacs-lisp

  (use-package embark
    :vc (:url "https://github.com/oantolin/embark")
    :bind
    ([remap describe-bindings]. embark-bindings)
    ("C-;" . embark-act)
    (
     :map embark-collect-mode-map
     ("j" . goto-char)
     )
    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none))))
    :custom
    (prefix-help-command #'embark-prefix-help-command)
    ;; Disable quitting after killing a buffer in an action
    (embark-quit-after-action '(
                                (kill-buffer . nil)
                                ))
    :ensure t
    )

#+end_src

*** Avy

#+begin_src emacs-lisp

  (use-package embark
    :after embark avy
    :config
    (defun karthinks/avy-action-embark (pt)
      "Jump to target at marker PT, and act on it using Embark."
      (unwind-protect
          (save-excursion
            (goto-char pt)
            (embark-act))
        (select-window
         (cdr (ring-ref avy-ring 0)))))

    (setf (alist-get ?\; avy-dispatch-alist) 'karthinks/avy-action-embark)
    )

#+end_src

*** [[https://github.com/oantolin/embark?tab=readme-ov-file#consult][Consult]]

#+begin_src emacs-lisp

  (use-package embark-consult
    :defer t
    :hook
    (embark-collect-mode . consult-preview-at-point-mode)
    )

#+end_src

*** [[https://github.com/oantolin/embark/wiki/Additional-Configuration#automatically-resizing-auto-updating-embark-collect-buffers-to-fit-their-contents][Collect Resizing]]

#+begin_src emacs-lisp

  (use-package embark
    :after embark
    :config
    (defun oantolin/embark-collect-resize-window (&rest _)
      "Resize the `embark-collect' window to match its contents."
      (when (memq embark-collect--kind '(:live :completions))
        (fit-window-to-buffer (get-buffer-window)
                               (floor (frame-height) 2) 1)))
    :hook
    (embark-collect-post-revert . oantolin/embark-collect-resize-window)
    )

#+end_src

*** Sudo Action

#+begin_src emacs-lisp

  (use-package embark
    :after embark
    :if (functionp #'karthinks/sudo-find-file)
    :bind
    (
     :map embark-file-map
     ("S" . karthinks/sudo-find-file)
     )
    )

#+end_src

*** [[https://github.com/oantolin/embark/wiki/Additional-Configuration#use-which-key-like-a-key-menu-prompt][Which Key]]

#+begin_src emacs-lisp

  (use-package embark
    :after embark
    :custom
    (embark-indicators '(
                         embark-which-key-indicator
                         embark-highlight-indicator
                         embark-isearch-highlight-indicator
                         ))
    :config
    (defun embark-which-key-indicator ()
      "An embark indicator that displays keymaps using which-key.
  The which-key help message will show the type and value of the
  current target followed by an ellipsis if there are further
  targets."
      (lambda (&optional keymap targets prefix)
        (if (null keymap)
            (which-key--hide-popup-ignore-command)
          (which-key--show-keymap
           (if (eq (plist-get (car targets) :type) 'embark-become)
               "Become"
             (format "Act on %s '%s'%s"
                     (plist-get (car targets) :type)
                     (embark--truncate-target (plist-get (car targets) :target))
                     (if (cdr targets) 'truncate-string-ellipsis "")))
           (if prefix
               (pcase (lookup-key keymap prefix 'accept-default)
                 ((and (pred keymapp) km) km)
                 (_ (key-binding prefix 'accept-default)))
             keymap)
           nil nil t (lambda (binding)
                       (not (string-suffix-p "-argument" (car binding))))))))

    (defun embark-hide-which-key-indicator (fn &rest args)
      "Hide the which-key indicator immediately when using the completing-read prompter."
      (which-key--hide-popup-ignore-command)
      (let ((embark-indicators
             (remq #'embark-which-key-indicator embark-indicators)))
        (apply fn args)))
    (advice-add #'embark-completing-read-prompter :around #'embark-hide-which-key-indicator)
    )

#+end_src

** [[https://github.com/zkry/p-search][p-search]]

#+begin_quote

p-search is an Emacs tool to find things. It combines concepts from information retrievial and [[https://www2.stat.duke.edu/~banks/130-labs.dir/lab10.dir/Lab10_bayesian_search.pdf][Bayesian search theory]] to assist a user in finding documents.

#+end_quote

#+begin_src emacs-lisp

  (use-package p-search
    :vc (:url "https://github.com/zkry/p-search")
    :bind
    ("M-s p" . p-search)
    :ensure t
    )

#+end_src

** [[https://github.com/karthink/popper][Popper]]

#+begin_quote

Emacs minor-mode to summon and dismiss buffers easily.

#+end_quote

#+begin_src emacs-lisp

  (use-package popper
    :vc (:url "https://github.com/karthink/popper")
    :bind
    ("M-]" . popper-cycle)
    ("M-[" . popper-toggle)
    :custom
    (popper-display-control t)
    (popper-group-function #'popper-group-by-project)
    (popper-reference-buffers '(
                                cider-repl-mode
                                compilation-mode
                                eat-mode
                                eshell-mode
                                flutter-mode
                                geiser-repl-mode
                                vterm-mode
                                inferior-emacs-lisp-mode
                                inferior-lisp-mode
                                inferior-python-mode
                                shell-mode
                                "\\*ansi-term\\*"
                                "\\*Async Shell Command\\*"
                                "\\*Backtrace\\*"
                                "\\*compilation\\*"
                                "\\*Dtache Shell Command\\*"
                                "\\*eldoc\\*"
                                "\\*Ement Notifications\\*"
                                "*Flymake diagnostics.*"
                                "\\*GDB.*out\\*"
                                "\\*Messages\\*"
                                "\\*mu4e-update\\*"
                                "Output\\*$"
                                "^*tex"
                                "\\*Warnings\\*"
                                "\\*xref\\*"
                                ))
    :ensure t
    :demand t
    :init
    (popper-mode)
    (popper-echo-mode)
    )

#+end_src

** [[https://github.com/tbanel/uniline][Uniline]]

#+begin_quote

Easily draw UNICODE lines and boxes.

#+end_quote

#+begin_src emacs-lisp

  (use-package uniline
    :vc (:url "https://github.com/tbanel/uniline")
    :bind
    ("C-z i l" . uniline-mode)
    :ensure t
    )

#+end_src


** End

#+begin_src emacs-lisp

  (provide 'gs-utils)
#+end_src

* Chatting
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-chat.el
:END:

Configuration for different chat clients.

** [[https://github.com/djcb/mu][mu4e]]

#+begin_quote

maildir indexer/searcher + emacs mail client + guile bindings.

#+end_quote

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp

  (use-package mu4e
    :vc (
         :url "https://github.com/djcb/mu"
         :lisp-dir "mu4e"
         )
    :commands
    (mu4e)
    :custom
    (mu4e-compose-format-flowed t)
    (mu4e-change-filenames-when-moving t)
    (mu4e-get-mail-command "mbsync -a")
    (mu4e-maildir (expand-file-name "!Mail-Provider/Personal/" mail-source-directory))
    (mu4e-view-show-addresses 't)
    (mu4e-view-show-images t)
    (mu4e-drafts-folder "/Drafts")
    (mu4e-sent-folder "/Sent")
    (mu4e-refile-folder "/All Mail")
    (mu4e-trash-folder "/Trash")
    (mu4e-maildir-shortcuts '(
                              ("/Inbox" . ?i)
                              ("/Drafts" . ?d)
                              ("/Sent" . ?s)
                              ("/Trash" . ?t)
                              ("/All Mail" . ?a)
                              ))
    )

#+end_src

*** [[https://github.com/Alexander-Miller/mu4e-column-faces][Column Faces]]

#+begin_src emacs-lisp

  (use-package mu4e-column-faces
    :vc (:url "https://github.com/Alexander-Miller/mu4e-column-faces")
    :after mu4e
    :config
    (mu4e-column-faces-mode)
    :ensure t
    )

#+end_src

*** Simple

#+begin_src emacs-lisp

  (use-package simple
    :after mu4e
    :custom
    (mail-user-agent 'mu4e-user-agent)
    )

#+end_src

*** Message

#+begin_src emacs-lisp

  (use-package message
    :custom
    (message-kill-buffer-on-exit t)
    (message-mail-user-agent t)
    (smtpmail-smtp-server "!mailprovider")
    (smtpmail-local-domain "!domain")
    (message-send-mail-function #'smtpmail-send-it)
    (smtpmail-smtp-service 465)
    (smtpmail-stream-type 'ssl)
    )

#+end_src

*** Startup

#+begin_src emacs-lisp

  (use-package startup
    :custom
    (user-mail-address "!email")
    :defer t
    )

#+end_src

** [[https://github.com/jeremy-compostella/org-msg][OrgMsg]]

#+begin_quote

OrgMsg is a GNU/Emacs global minor mode mixing up Org mode and Message mode to compose and reply to emails in a Outlook HTML friendly style. 

#+end_quote

#+begin_src emacs-lisp

  (use-package org-msg
    :vc (:url "https://github.com/jeremy-compostella/org-msg")
    :after mu4e
    :custom
    (org-msg-greeting-fmt "\nGreetings,\n\n")
    (org-msg-default-alternatives '(
                                    (new . (text html))
                                    (reply-to-html . (text html))
                                    (reply-to-text . (text))
                                    ))
    (org-msg-convert-citation t)
    (org-msg-signature
     "Regards,

  #+begin_signature
  --
  Gabriel Santos
  #+end_signature"
     )
    :ensure t
    :config
    (org-msg-mode)
    )

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'gs-chat)
#+end_src

* [[https://github.com/skeeto/elfeed][Elfeed]]
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-elfeed.el
:CREDITS:  https://midirus.com/emacs/tutorial#elfeed
:END:

#+begin_quote

Elfeed is an extensible web feed reader for Emacs, supporting both Atom and RSS.

#+end_quote

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp

  (use-package elfeed
    :vc (:url "https://github.com/skeeto/elfeed")
    :bind
    (
     :map elfeed-search-mode-map
     ("R" . kaushal-modi/elfeed-search-mark-all-as-read)
     :map elfeed-show-mode-map
     ("C-c C-o" . shr-browse-url)
     )
    :config
    ;; https://emacs.stackexchange.com/a/2441
    (defun kaushal-modi/elfeed-search-mark-all-as-read ()
      "Call `mark-whole-buffer' and `elfeed-search-untag-all-undead' in unison,
  marking all current messages as read."
      (interactive)
      (mark-whole-buffer)
      (elfeed-search-untag-all-unread))
    :defer t
    :ensure t
    )

#+end_src

** [[https://github.com/remyhonig/elfeed-org][Org Mode]]

#+begin_quote

Configure the Elfeed RSS reader with an Orgmode file.

#+end_quote

#+begin_src emacs-lisp

  (use-package elfeed-org
    :vc (:url "https://github.com/remyhonig/elfeed-org")
    :after elfeed org
    :config
    (elfeed-org)
    :custom
    (rmh-elfeed-org-files (list (expand-file-name "elfeed.org" org-directory)))
    :ensure t
    )

#+end_src

** [[https://karthinks.com/software/lazy-elfeed/#open-feeds-in-emacs][EWW]]

#+begin_src emacs-lisp

  (use-package elfeed
    :bind
    (
     :map elfeed-show-mode-map
     ("B" . karthinks/elfeed-show-eww-open)
     :map elfeed-search-mode-map
     ("B" . karthinks/elfeed-search-eww-open)
     )
    :config
    (defun karthinks/elfeed-show-eww-open (&optional use-generic-p)
      "Open elfeed show entry with \\[eww]."
      (interactive "P")
      (let ((browse-url-browser-function #'eww-browse-url))
        (elfeed-show-visit use-generic-p)))
    (defun karthinks/elfeed-search-eww-open (&optional use-generic-p)
      "Open elfeed search entry with \\[eww]."
      (interactive "P")
      (let ((browse-url-browser-function #'eww-browse-url))
        (elfeed-search-browse-url use-generic-p)))
    )

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'gs-elfeed)
#+end_src

* [[https://github.com/emacs-evil/evil][Evil Mode]]
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-keys-evil.el
:END:

#+begin_quote

The extensible vi layer for Emacs.

#+end_quote

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** Simple

Bind the universal argument to another key to avoid conflicts.

#+begin_src emacs-lisp

  (use-package simple
    :bind
    ("C-M-u" . universal-argument)
    )

#+end_src

** Emacs

This is needed for ~evil-collection~.

#+begin_src emacs-lisp

  (use-package emacs
    :custom
    (evil-want-keybinding nil)
    )

#+end_src

** Evil

#+begin_quote

The extensible vi layer for Emacs.

#+end_quote

#+begin_src emacs-lisp

  (use-package evil
    :ensure t
    )

#+end_src

** Core

#+begin_quote

Core functionality.

#+end_quote

#+begin_src emacs-lisp

  (use-package evil-core
    :config
    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
    :init
    (evil-mode)
    )

#+end_src

** Variables
:PROPERTIES:
:CREDITS:  1. [[https://codeberg.org/blau_araujo/edz/src/branch/main/parte-05/config.org#headline-28][blau_araujo]], 2. [[https://github.com/Gavinok/emacs.d/blob/main/lisp/evil-config.el][Gavinok]]
:END:

#+begin_quote

Settings and variables.

#+end_quote

#+begin_src emacs-lisp

  (use-package evil-vars
    :custom
    (evil-disable-insert-state-bindings t) ;; 2
    (evil-respect-visual-line-mode t) ;; 1
    (evil-undo-system 'undo-redo)
    (evil-split-window-below t) ;; 1
    (evil-v$-excludes-newline t) ;; 1
    (evil-vsplit-window-right t) ;; 1
    (evil-want-C-i-jump nil) ;; 1
    (evil-want-C-u-scroll t)
    (evil-want-Y-yank-to-eol t) ;; 2
    )

#+end_src

