emacs.org
** Avy

#+begin_src emacs-lisp

  (use-package meow-command
    :after meow avy
    :bind
    (
     :map meow-normal-state-keymap
     ([remap meow-pop-to-mark] . favetelinguis/meow-jumper)
     )
    :config
    (defun gs-101/meow-avy-action-kill-whole-line (pt)
      "Jump to target at marker PT, killing its whole line after the jump.
  This follows the parameters set by `meow-kill-whole-line'."
      (save-excursion
        (goto-char pt)
        (meow-kill-whole-line)))

    (defun gs-101/meow-avy-action-block (pt)
      "Mark block at PT."
      (goto-char pt)
      (meow-block pt))

    (setf
     (alist-get ?K avy-dispatch-alist) #'gs-101/meow-avy-action-kill-whole-line
     (alist-get ?m avy-dispatch-alist) #'gs-101/meow-avy-action-block
     )

    (defun favetelinguis/meow-jumper (&optional arg)
      "Switch between Meow search and Avy,
  depending on if the region is active.
  If the region is active, this function calls `meow-search'.
  Otherwise, it calls `avy-goto-char-timer'."
      (interactive)
      (if (region-active-p)
          (meow-search arg)
        (avy-goto-char-timer)))
    )

#+end_src

** [[https://github.com/skissue/meow-tree-sitter][Tree-Sitter]]

#+begin_quote

Tree-sitter powered motions for Meow.

#+end_quote

#+begin_src emacs-lisp

  (use-package meow-tree-sitter
    :vc (:url "https://github.com/skissue/meow-tree-sitter")
    :ensure t
    :config
    (meow-tree-sitter-register-defaults)
    )

#+end_src

** Embark

#+begin_src emacs-lisp

  (use-package meow-helpers
    :after embark
    :config
    (meow-normal-define-key
     '(";" . embark-act))
    )

#+end_src

** [[https://github.com/awth13/org-appear/issues/42#issuecomment-1063517134][Org Appear]]

#+begin_src emacs-lisp

  (use-package meow-core
    :after org-appear
    :custom
    (org-appear-trigger 'manual)
    :config
    (add-hook 'org-mode-hook (lambda ()
                               (add-hook 'meow-insert-enter-hook
                                         #'org-appear-manual-start
                                         nil
                                         t)
                               (add-hook 'meow-insert-exit-hook
                                         #'org-appear-manual-stop
                                         nil
                                         t)))
    )

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'gs-keys-meow)
#+end_src

* User Interface
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-ui.el
:END:

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** IMPORTANT

[[https://www.masteringemacs.org/article/bad-emacs-advice][Enable the menu bar if you're a new user]].
It may not look good, but it is a really useful tool.
You can disable it after getting used to Emacs.

** Emacs

#+begin_src emacs-lisp

  (use-package emacs
    :custom
    (menu-bar-mode nil)
    (ring-bell-function #'ignore)
    (scroll-preserve-screen-position t)
    (tool-bar-mode nil)
    (tooltip-mode nil)
    (use-dialog-box nil)
    (use-file-dialog nil)
    (visible-bell nil)
    (x-stretch-cursor t)
    (x-underline-at-descent-line nil)
    )

#+END_src

** Display Line Numbers

#+begin_quote

Interface for display-line-numbers.

#+end_quote

#+begin_src emacs-lisp

  (use-package display-line-numbers
    :hook
    (prog-mode . display-line-numbers-mode)
    )

#+end_src

** [[https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org#font-configuration][Faces]]

#+begin_quote

Lisp faces.

#+end_quote

#+begin_src emacs-lisp

  (use-package faces
    :preface
    (defun dw/set-font-faces ()
      ;; Set the default face
      (set-face-attribute 'default nil :font "Cascadia Code NF")
      ;; Set the fixed pitch face
      (set-face-attribute 'fixed-pitch nil :font "Cascadia Mono NF")
      ;; Set the variable pitch face
      (set-face-attribute 'variable-pitch nil :font "Cascadia Code NF" :weight 'regular))
    :init
    (dw/set-font-faces)
    )

#+end_src

*** Daemon Support

#+begin_src emacs-lisp

  (use-package faces
    :if (daemonp)
    :config
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (with-selected-frame frame
                  (dw/set-font-faces))))
    )

#+end_src

*** [[https://github.com/jamescherti/minimal-emacs.d/blob/837e3d46acfe5a6c385b4ae253b9549d89ece1cf/init.el#L106][Frame]]

#+begin_quote

Multi-frame management independent of window systems.

#+end_quote

#+begin_src emacs-lisp

  (use-package frame
    :config (setq-mode-local doc-view-mode blink-cursor-mode nil)
    :custom
    (window-divider-default-bottom-width 1)
    (window-divider-default-places t)
    (window-divider-default-right-width 1)
    :init
    (window-divider-mode)
    )

#+end_src

** Mouse
:PROPERTIES:
:CREDITS:  https://codeberg.org/ashton314/emacs-bedrock/src/commit/f17a4b4d5116ac7eec3b30a0d43fa46eb074da0b/init.el#L73
:END:


#+begin_src emacs-lisp

  (use-package mouse
    :if (display-graphic-p)
    :init
    (context-menu-mode)
    )
#+end_src

*** Daemon Support

#+begin_src emacs-lisp

  (use-package mouse
    :if (daemonp)
    :config
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (context-menu-mode)))
    )

#+end_src

** Org Mode

*** [[https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org#better-font-faces][Faces]]

#+begin_src emacs-lisp

  (use-package org-faces
    :config
    (dolist
        (face '(
                (org-level-1 . 1.30)
                (org-level-2 . 1.29)
                (org-level-3 . 1.28)
                (org-level-4 . 1.27)
                (org-level-5 . 1.26)
                (org-level-6 . 1.25)
                (org-level-7 . 1.24)
                (org-level-8 . 1.23)
                )
              )
      (set-face-attribute (car face) nil :font "Cascadia Code NF" :weight 'medium :height (cdr face)))
    (set-face-attribute 'org-document-title nil :font "Cascadia Code NF" :weight 'medium :height 1.40)
    )

#+end_src

*** Fontify

#+begin_src emacs-lisp

  (use-package org
    :custom
    (org-ellipsis 'truncate-string-ellipsis)
    (org-fontify-done-headline t)
    (org-fontify-quote-and-verse-blocks t)
    (org-fontify-whole-heading-line t)
    (org-hide-emphasis-markers t)
    (org-hide-leading-stars)
    )

#+end_src

*** Prettify

#+begin_src emacs-lisp

  (use-package org
    :custom
    (org-pretty-entities t)
    (org-pretty-entities-include-sub-superscripts t)
    )

#+end_src

*** [[https://github.com/minad/org-modern][Org Modern]]

#+begin_quote

Modern Org Style.

#+end_quote

#+begin_src emacs-lisp

  (use-package org-modern
    :vc (:url "https://github.com/minad/org-modern")
    :custom
    (org-modern-star 'replace)
    (org-modern-replace-stars "󰪥󰪤󰪣󰪢󰪡󰪠󰪟")
    (org-modern-table-vertical 1)
    :ensure t
    :init
    (global-org-modern-mode)
    )

#+end_src

**** Prettify Agenda

#+begin_src emacs-lisp

  (use-package org-agenda
    :custom
    (org-agenda-block-separator ?─)
    (org-agenda-current-time-string
     "←──────────────")
    (org-agenda-time-grid
     '((daily today require-timed)
       (600 800 1000 1200 1400 1600 1800 2000 2200)
       " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄"))
    )

#+end_src

** Scroll Bar

#+begin_quote

Window system-independent scroll bar support.

#+end_quote

#+begin_src emacs-lisp

  (use-package scroll-bar
    :custom
    (scroll-bar-mode nil)
    )

#+end_src

** Startup
:PROPERTIES:
:CREDITS:  https://github.com/jamescherti/minimal-emacs.d/blob/837e3d46acfe5a6c385b4ae253b9549d89ece1cf/early-init.el#L182
:END:

#+begin_quote

This file parses the command line and gets Emacs running. Options on the command line are handled in precedence order.

#+end_quote

#+begin_src emacs-lisp

  (use-package startup
    :config
    (advice-add #'display-startup-echo-area-message :override #'ignore)
    (advice-add #'display-startup-screen :override #'ignore)
    :custom
    (initial-scratch-message nil)
    (inhibit-startup-echo-area-message t)
    (inhibit-startup-message t)
    (inhibit-startup-screen t)
    :defer t
    )

#+end_src

** Window
:PROPERTIES:
:CREDITS:  1. [[https://github.com/jamescherti/minimal-emacs.d/blob/main/init.el][jamescherti]], 2. [[https://github.com/oantolin/emacs-config/blob/a80c3b6a4c7e0fa87254a0c148fe7f9b2976edd1/init.el][oantolin]]
:END:

#+begin_quote

Window tree functions.

#+end_quote

#+begin_src emacs-lisp

  (use-package window
    :custom
    (recenter-positions '(top middle bottom)) ;; 2
    (scroll-error-top-bottom t) ;; 1
    (split-height-threshold nil) ;;1
    (split-width-threshold 170) ;; 1
    (switch-to-buffer-obey-display-actions t) ;; 2
    )

#+end_src


** Which Key
:PROPERTIES:
:CREDITS:  https://codeberg.org/blau_araujo/edz/src/branch/main/parte-06-final/config.org#headline-37
:END:

#+begin_quote

Display available keybindings in popup.

#+end_quote

#+begin_src emacs-lisp

  (use-package which-key
    :custom
    (which-key-add-column-padding 1)
    (which-key-idle-delay 0.5)
    (which-key-min-display-lines 6)
    (which-key-separator " = ")
    (which-key-side-window-slot -10)
    (which-key-sort-order #'which-key-key-order-alpha)
    (which-key-sort-uppercase-first nil)
    :init
    (which-key-mode)
    )

#+end_src

** [[https://github.com/catppuccin/emacs][Catppuccin]]

#+begin_quote

Soothing pastel theme for Emacs.

#+end_quote

#+begin_src emacs-lisp

  (use-package catppuccin-theme
    :preface
    (load-theme 'catppuccin t)
    :ensure t
    )

#+end_src

** [[https://github.com/ankurdave/color-identifiers-mode][Color Identifier Mode]]

#+begin_quote

Emacs minor mode to highlight each source code identifier uniquely based on its name.

#+end_quote

#+begin_src emacs-lisp

  (use-package color-identifiers-mode
    :vc (:url "https://github.com/ankurdave/color-identifiers-mode")
    :ensure t
    :config
    (defun gs-101/color-identifiers-toggle-on-ts-mode ()
      "Enable `color-identifiers-mode' in tree-sitter modes.

  Disable if `prism-mode' is currently enabled on the buffer."
      (when (string-match-p "-ts-mode\\'" (symbol-name major-mode))
        (color-identifiers-mode))
      (when (bound-and-true-p prism-mode)
        (setq-local color-identifiers-mode nil)))
    :hook
    (prog-mode . gs-101/color-identifiers-toggle-on-ts-mode)
    )

#+end_src

