emacs.org
** [[https://github.com/seagle0128/doom-modeline][DOOM Modeline]]

#+begin_quote

A fancy and fast mode-line inspired by minimalism design.

#+end_quote

#+begin_src emacs-lisp

  (use-package doom-modeline
    :vc (:url "https://github.com/seagle0128/doom-modeline")
    :config
    (advice-add #'doom-modeline-lsp-icon :override
                (defun gs-101/doom-modeline-lsp-icon (text face)
                  "Display LSP icon (or TEXT in terminal) with FACE.

  This advice replaces the rocket icon with a electric plug icon."
                  (if doom-modeline-lsp-icon
                      (doom-modeline-icon 'mdicon "nf-md-connection" "🔌" text :face face)
                    (propertize text 'face face))))
    :custom
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-buffer-file-name-style 'relative-to-project)
    (doom-modeline-ellipsis 'truncate-string-ellipsis)
    (doom-modeline-enable-word-count t)
    (doom-modeline-modal-modern-icon nil)
    :ensure t
    :init
    (doom-modeline-mode)
    )

#+end_src

*** Daemon Support

#+begin_src emacs-lisp

  (use-package doom-modeline
    :after doom-modeline
    :if (daemonp)
    :config
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (setq doom-modeline-icon t)))
    )

#+end_src

** [[https://github.com/purcell/diredfl][diredfl]]

#+begin_quote

Extra Emacs font lock rules for a more colourful dired.

#+end_quote

#+begin_src emacs-lisp

  (use-package diredfl
    :vc (:url "https://github.com/purcell/diredfl")
    :ensure t
    :hook
    (dired-mode . diredfl-mode)
    )

#+end_src

** [[https://github.com/casouri/eldoc-box][ElDoc Box]]

#+begin_quote

Childframe doc for eglot and anything that uses eldoc.

#+end_quote

#+begin_src emacs-lisp

  (use-package eldoc-box
    :vc (:url "https://github.com/casouri/eldoc-box")
    :after eldoc
    :ensure t
    :config
    (setq-mode-local typescript-ts-base-mode eldoc-box-buffer-setup-function #'eldoc-box-prettify-ts-errors-setup)
    (setq-mode-local tsx-ts-mode eldoc-box-buffer-setup-function #'eldoc-box-prettify-ts-errors-setup)
    :hook
    (eldoc-mode . eldoc-box-hover-mode)
    )

#+end_src

** [[https://github.com/Wilfred/helpful][Helpful]]

#+begin_quote

A better Emacs help buffer.

#+end_quote

#+begin_src emacs-lisp

  (use-package helpful
    :vc (:url "https://github.com/Wilfred/helpful")
    :bind
    ([remap describe-command] . helpful-command)
    ([remap describe-function] . helpful-callable)
    ([remap describe-key] . helpful-key)
    ([remap describe-symbol] . helpful-symbol)
    ([remap describe-variable] . helpful-variable)
    :config
    (set-face-attribute 'helpful-heading nil :height 1.5)
    :ensure t
    )

#+end_src

** [[https://github.com/tarsius/hl-todo][hl-todo]]

#+begin_quote

Highlight TODO keywords.

#+end_quote

#+begin_src emacs-lisp

  (use-package hl-todo
    :vc (:url "https://github.com/tarsius/hl-todo")
    :custom
    (hl-todo-keyword-faces '(
                             ("FIXME" . "red")
                             ("NOTE" . "yellow")
                             ("QUESTION" . "yellow")
                             ("ANSWER" . "green")
                             ("FIX" . "red")
                             ("FEAT" . "yellow")
                             ("DOCS" . "white")
                             ("HACK" . "green")
                             ("STYLE" . "orange")
                             ("REFACTOR" . "white")
                             ("REVIEW" . "white")
                             ("CHORE" . "grey")
                             ("MERGED" . "green")
                             ("CLOSED" . "red")
                             ))
    :ensure t
    :hook
    (prog-mode . hl-todo-mode)
    (text-mode . hl-todo-mode)
    )

#+end_src

*** Catppuccin Colors

#+begin_src emacs-lisp

  (use-package hl-todo
    :after hl-todo catppuccin-theme
    :custom
    (hl-todo-keyword-faces
     (mapcar (lambda (keyword-color)
               (cons (car keyword-color)
                     (catppuccin-get-color (cdr keyword-color))))
             '(
               ("FIXME" . red)
               ("NOTE" . yellow)
               ("QUESTION" . yellow)
               ("ANSWER" . green)
               ("FIX" . red)
               ("FEAT" . yellow)
               ("DOCS" . blue)
               ("HACK" . green)
               ("STYLE" . lavender)
               ("REFACTOR" . sapphire)
               ("REVIEW" . sapphire)
               ("CHORE" . overlay0)
               ("MERGED" . green)
               ("CLOSED" . red)
               )))
    )

#+end_src

** [[https://github.com/tarsius/keycast][Keycast]]

#+begin_quote

Show current command and its key in the mode line.

#+end_quote

#+begin_src emacs-lisp

  (use-package keycast
    :vc (:url "https://github.com/tarsius/keycast")
    :config
    (set-face-attribute 'keycast-key nil :background 'unspecified :foreground 'unspecified :box 'unspecified)
    :ensure t
    :init
    (define-minor-mode keycast-mode
      "Show current command and its key binding in the mode line (fix for use with `doom-modeline')."
      :global t
      (if keycast-mode
          (add-hook 'pre-command-hook 'keycast--update t)
        (remove-hook 'pre-command-hook 'keycast--update)))
    (add-to-list 'global-mode-string '("" keycast-mode-line))
    (keycast-mode)
    )

#+end_src

*** Command Customization

#+begin_src emacs-lisp

  (use-package keycast
    :after keycast
    :config
    (mapc (lambda (command)
            (add-to-list 'keycast-substitute-alist command)) '(
            (backward-delete-char-untabify "" "Erasing...")
            (delete-backward-char "" "Erasing...")
            (org-delete-backward-char "" "Erasing...")
            (self-insert-command "" "Typing...")
            (org-self-insert-command "" "Typing...")
            (vertico-next nil nil)
            (vertico-previous nil nil)
            ))
    )

#+end_src

*** Daemon Support

#+begin_src emacs-lisp

  (use-package keycast
    :if (daemonp)
    :config
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (with-selected-frame frame
                  (set-face-attribute 'keycast-key nil :background 'unspecified :foreground "default" :box 'unspecified))))
    )

#+end_src

*** [[https://github.com/oantolin/embark/wiki/Additional-Configuration#showing-embark-actions-keys-in-keycast-mode][Embark Support]]

#+begin_src emacs-lisp

  (use-package keycast
    :after embark
    :config
    (defun oantolin/keycast-store-action-key-cmd (cmd)
      "Store key and CMD command information for `keycast' use."
      (force-mode-line-update t)
      (setq this-command cmd
            keycast--this-command-keys (this-single-command-keys)
            keycast--this-command-desc cmd))
    (advice-add #'embark-keymap-prompter :filter-return #'oantolin/keycast-store-action-key-cmd)
    (defun oantolin/keycast--update-force (&rest _)
      "Version of `keycast--update' that accepts (and ignore) parameters."
      (keycast--update))
    (advice-add 'embark-act :before #'oantolin/keycast--update-force)
    )

#+end_src

