modules/gs-ui.el
  :vc (:url "https://github.com/seagle0128/doom-modeline")
  :config
  (advice-add #'doom-modeline-lsp-icon :override
              (defun gs-101/doom-modeline-lsp-icon (text face)
                "Display LSP icon (or TEXT in terminal) with FACE.

This advice replaces the rocket icon with a electric plug icon."
                (if doom-modeline-lsp-icon
                    (doom-modeline-icon 'mdicon "nf-md-connection" "🔌" text :face face)
                  (propertize text 'face face))))
  :custom
  (doom-modeline-buffer-encoding nil)
  (doom-modeline-ellipsis 'truncate-string-ellipsis)
  (doom-modeline-enable-word-count t)
  (doom-modeline-modal-modern-icon nil)
  :ensure t
  :init
  (doom-modeline-mode)
  )

(use-package doom-modeline
  :after doom-modeline
  :if (daemonp)
  :config
  (add-hook 'after-make-frame-functions
            (lambda (frame)
              (setq doom-modeline-icon t)))
  )

(use-package diredfl
  :vc (:url "https://github.com/purcell/diredfl")
  :ensure t
  :hook
  (dired-mode . diredfl-mode)
  )

(use-package eldoc-box
  :vc (:url "https://github.com/casouri/eldoc-box")
  :after eldoc
  :ensure t
  :config
  (setq-mode-local typescript-ts-base-mode eldoc-box-buffer-setup-function #'eldoc-box-prettify-ts-errors-setup)
  (setq-mode-local tsx-ts-mode eldoc-box-buffer-setup-function #'eldoc-box-prettify-ts-errors-setup)
  :hook
  (eldoc-mode . eldoc-box-hover-mode)
  )

(use-package helpful
  :vc (:url "https://github.com/Wilfred/helpful")
  :bind
  ([remap describe-command] . helpful-command)
  ([remap describe-function] . helpful-callable)
  ([remap describe-key] . helpful-key)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  :config
  (set-face-attribute 'helpful-heading nil :height 1.5)
  :ensure t
  )

(use-package hl-todo
  :vc (:url "https://github.com/tarsius/hl-todo")
  :custom
  (hl-todo-keyword-faces '(
                           ("FIXME" . "red")
                           ("NOTE" . "yellow")
                           ("QUESTION" . "yellow")
                           ("ANSWER" . "green")
                           ("FIX" . "red")
                           ("FEAT" . "yellow")
                           ("DOCS" . "white")
                           ("HACK" . "green")
                           ("STYLE" . "orange")
                           ("REFACTOR" . "white")
                           ("REVIEW" . "white")
                           ("CHORE" . "grey")
                           ("MERGED" . "green")
                           ("CLOSED" . "red")
                           ))
  :ensure t
  :hook
  (prog-mode . hl-todo-mode)
  (text-mode . hl-todo-mode)
  )

(use-package hl-todo
  :after hl-todo catppuccin-theme
  :custom
  (hl-todo-keyword-faces
   (mapcar (lambda (keyword-color)
             (cons (car keyword-color)
                   (catppuccin-get-color (cdr keyword-color))))
           '(
             ("FIXME" . red)
             ("NOTE" . yellow)
             ("QUESTION" . yellow)
             ("ANSWER" . green)
             ("FIX" . red)
             ("FEAT" . yellow)
             ("DOCS" . blue)
             ("HACK" . green)
             ("STYLE" . lavender)
             ("REFACTOR" . sapphire)
             ("REVIEW" . sapphire)
             ("CHORE" . overlay0)
             ("MERGED" . green)
             ("CLOSED" . red)
             )))
  )

(use-package keycast
  :vc (:url "https://github.com/tarsius/keycast")
  :config
  (set-face-attribute 'keycast-key nil :background 'unspecified :foreground 'unspecified :box 'unspecified)
  :ensure t
  :init
  (define-minor-mode keycast-mode
    "Show current command and its key binding in the mode line (fix for use with `doom-modeline')."
    :global t
    (if keycast-mode
        (add-hook 'pre-command-hook 'keycast--update t)
      (remove-hook 'pre-command-hook 'keycast--update)))
  (add-to-list 'global-mode-string '("" keycast-mode-line))
  (keycast-mode)
  )

(use-package keycast
  :after keycast
  :config
  (mapc (lambda (command)
          (add-to-list 'keycast-substitute-alist command)) '(
          (backward-delete-char-untabify "" "Erasing...")
          (delete-backward-char "" "Erasing...")
          (org-delete-backward-char "" "Erasing...")
          (self-insert-command "" "Typing...")
          (org-self-insert-command "" "Typing...")
          (vertico-next nil nil)
          (vertico-previous nil nil)
          ))
  )

(use-package keycast
  :if (daemonp)
  :config
  (add-hook 'after-make-frame-functions
            (lambda (frame)
              (with-selected-frame frame
                (set-face-attribute 'keycast-key nil :background 'unspecified :foreground "default" :box 'unspecified))))
  )

(use-package keycast
  :after embark
  :config
  (defun oantolin/keycast-store-action-key-cmd (cmd)
    "Store key and CMD command information for `keycast' use."
    (force-mode-line-update t)
    (setq this-command cmd
          keycast--this-command-keys (this-single-command-keys)
          keycast--this-command-desc cmd))
  (advice-add #'embark-keymap-prompter :filter-return #'oantolin/keycast-store-action-key-cmd)
  (defun oantolin/keycast--update-force (&rest _)
    "Version of `keycast--update' that accepts (and ignore) parameters."
    (keycast--update))
  (advice-add 'embark-act :before #'oantolin/keycast--update-force)
  )
