emacs.org
** [[https://github.com/mickeynp/ligature.el][Ligatures]]

#+begin_quote

Display typographical ligatures in Emacs.

#+end_quote

#+begin_src emacs-lisp

  (use-package ligature
    :vc (:url "https://github.com/mickeynp/ligature.el")
    :config
    (ligature-set-ligatures 't '("www"))
    ;; Enable traditional ligature support in eww-mode, if the `variable-pitch' face supports it
    (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
    ;; Enable all Cascadia and Fira Code ligatures in programming modes
    (ligature-set-ligatures 'prog-mode
                            '(;; == === ==== => =| =>>=>=|=>==>> ==< =/=//=// =~
                              ;; =:= =!=
                              ("=" (rx (+ (or ">" "<" "|" "/" "~" ":" "!" "="))))
                              ;; ;; ;;;
                              (";" (rx (+ ";")))
                              ;; && &&&
                              ("&" (rx (+ "&")))
                              ;; !! !!! !. !: !!. != !== !~
                              ("!" (rx (+ (or "=" "!" "\." ":" "~"))))
                              ;; ?? ??? ?:  ?=  ?.
                              ("?" (rx (or ":" "=" "\." (+ "?"))))
                              ;; %% %%%
                              ("%" (rx (+ "%")))
                              ;; |> ||> |||> ||||> |] |} || ||| |-> ||-||
                              ;; |->>-||-<<-| |- |== ||=||
                              ;; |==>>==<<==<=>==//==/=!==:===>
                              ("|" (rx (+ (or ">" "<" "|" "/" ":" "!" "}" "\]"
                                              "-" "=" ))))
                              ;; \\ \\\ \/
                              ("\\" (rx (or "/" (+ "\\"))))
                              ;; ++ +++ ++++ +>
                              ("+" (rx (or ">" (+ "+"))))
                              ;; :: ::: :::: :> :< := :// ::=
                              (":" (rx (or ">" "<" "=" "//" ":=" (+ ":"))))
                              ;; // /// //// /\ /* /> /===:===!=//===>>==>==/
                              ("/" (rx (+ (or ">"  "<" "|" "/" "\\" "\*" ":" "!"
                                              "="))))
                              ;; .. ... .... .= .- .? ..= ..<
                              ("\." (rx (or "=" "-" "\?" "\.=" "\.<" (+ "\."))))
                              ;; -- --- ---- -~ -> ->> -| -|->-->>->--<<-|
                              ("-" (rx (+ (or ">" "<" "|" "~" "-"))))
                              ;; *> */ *)  ** *** ****
                              ("*" (rx (or ">" "/" ")" (+ "*"))))
                              ;; www wwww
                              ("w" (rx (+ "w")))
                              ;; <> <!-- <|> <: <~ <~> <~~ <+ <* <$ </  <+> <*>
                              ;; <$> </> <|  <||  <||| <|||| <- <-| <-<<-|-> <->>
                              ;; <<-> <= <=> <<==<<==>=|=>==/==//=!==:=>
                              ;; << <<< <<<<
                              ("<" (rx (+ (or "\+" "\*" "\$" "<" ">" ":" "~"  "!"
                                              "-"  "/" "|" "="))))
                              ;; >: >- >>- >--|-> >>-|-> >= >== >>== >=|=:=>>
                              ;; >> >>> >>>>
                              (">" (rx (+ (or ">" "<" "|" "/" ":" "=" "-"))))
                              ;; #: #= #! #( #? #[ #{ #_ #_( ## ### #####
                              ("#" (rx (or ":" "=" "!" "(" "\?" "\[" "{" "_(" "_"
                                           (+ "#"))))
                              ;; ~~ ~~~ ~=  ~-  ~@ ~> ~~>
                              ("~" (rx (or ">" "=" "-" "@" "~>" (+ "~"))))
                              ;; __ ___ ____ _|_ __|____|_
                              ("_" (rx (+ (or "_" "|"))))
                              ;; The few not covered by the regexps.
                              "{|"  "[|"  "]#"  "(*"  "}#"  "$>"  "^="))
    :ensure t
    :hook
    (prog-mode . ligature-mode)
    )

#+end_src

** Markdown

#+begin_src emacs-lisp

  (use-package markdown-mode
    :after markdown-mode
    :custom
    (markdown-enable-highlighting-syntax t)
    (markdown-hide-markup t)
    )

#+end_src


** [[https://github.com/rainstormstudio/nerd-icons.el][Nerd Icons]]

#+begin_quote

A Library for Nerd Font icons.

#+end_quote

#+begin_src emacs-lisp

  (use-package nerd-icons
    :vc (:url "https://github.com/rainstormstudio/nerd-icons.el")
    :bind
    ("C-z i n" . nerd-icons-insert)
    :demand t
    :ensure t
    )

#+end_src

*** [[https://github.com/emacs-citar/citar/wiki/Indicators#nerd-icons][Citar]]

#+begin_src emacs-lisp

  (use-package citar
    :after citar nerd-icons
    :config
      (defvar citar-indicator-cited-icons
        (citar-indicator-create
         :symbol (nerd-icons-mdicon
                  "nf-md-record"
                  :face 'nerd-icons-lgreen)
         :function #'citar-is-cited
         :padding "  "
         :tag "is:cited"))
        (defvar citar-indicator-files-icons
        (citar-indicator-create
         :symbol (nerd-icons-mdicon
                  "nf-md-file"
                  :face 'nerd-icons-blue
                  :v-adjust -0.1)
         :function #'citar-has-files
         :padding "  " ; need this because the default padding is too low for these icons
         :tag "has:files"))
      (defvar citar-indicator-links-icons
        (citar-indicator-create
         :symbol (nerd-icons-mdicon
                  "nf-md-link"
                  :face 'nerd-icons-lblue
                  :v-adjust 0.01)
         :function #'citar-has-links
         :padding "  "
         :tag "has:links"))
      (defvar citar-indicator-notes-icons
        (citar-indicator-create
         :symbol (nerd-icons-mdicon
                  "nf-md-text"
                  :face 'nerd-icons-blue
                  :v-adjust -0.3)
         :function #'citar-has-notes
         :padding "    "
         :tag "has:notes"))
      (setq citar-indicators
       (list
        citar-indicator-cited-icons
        citar-indicator-files-icons
        citar-indicator-links-icons
        citar-indicator-notes-icons
        ))
      )

#+end_src

*** [[https://github.com/rainstormstudio/nerd-icons-completion][Completion]]

#+begin_src emacs-lisp

  (use-package nerd-icons-completion
    :vc (:url "https://github.com/rainstormstudio/nerd-icons-completion")
    :after nerd-icons
    :ensure t
    :config
    (nerd-icons-completion-mode)
    )

#+end_src

**** [[https://github.com/rainstormstudio/nerd-icons-completion?tab=readme-ov-file#setup][Marginalia]]

#+begin_src emacs-lisp

  (use-package nerd-icons-completion
    :after nerd-icons
    :hook
    (marginalia-mode . nerd-icons-completion-marginalia-setup)
    )

#+end_src

*** [[https://github.com/mohkale/compile-multi/tree/master?tab=readme-ov-file#compile-multi-nerd-icons][compile-multi]]

#+begin_src emacs-lisp

  (use-package compile-multi-nerd-icons
    :after nerd-icons compile-multi
    :ensure t
    )

#+end_src

