emacs.org
*** [[https://github.com/LuigiPiucco/nerd-icons-corfu][Corfu]]

#+begin_src emacs-lisp

  (use-package nerd-icons-corfu
    :vc (:url "https://github.com/LuigiPiucco/nerd-icons-corfu")
    :after nerd-icons corfu
    :custom
    (corfu-margin-formatters #'nerd-icons-corfu-formatter)
    (nerd-icons-corfu-mapping '(
                                 (array :style "md" :icon "code_array" :face font-lock-type-face)
                                (boolean :style "md" :icon "checkbox_intermediate" :face font-lock-builtin-face)
                                (class :style "md" :icon "file_tree" :face font-lock-type-face)
                                (color :style "md" :icon "format_paint" :face success)
                                (command :style "dev" :icon "terminal" :face default)
                                (constant :style "md" :icon "card_text_outline" :face font-lock-constant-face)
                                (constructor :style "md" :icon "arrow_right" :face font-lock-function-name-face)
                                (enummember :style "md" :icon "cards_outline" :face font-lock-builtin-face)
                                (enum-member :style "md" :icon "cards_outline" :face font-lock-builtin-face)
                                (enum :style "md" :icon "card_text_outline" :face font-lock-builtin-face)
                                (event :style "md" :icon "lightning_bolts" :face font-lock-warning-face)
                                (field :style "md" :icon "toy_brick" :face font-lock-variable-name-face)
                                (file :style "md" :icon "file" :face font-lock-string-face)
                                (folder :style "md" :icon "folder" :face font-lock-doc-face)
                                (interface :style "md" :icon "transit_connection_variant" :face font-lock-type-face)
                                (keyword :style "md" :icon "text" :face font-lock-keyword-face)
                                (macro :style "md" :icon "arrow_expand" :face font-lock-keyword-face)
                                (magic :style "md" :icon "magic_staff" :face font-lock-builtin-face)
                                (method :style "md" :icon "cube_outline" :face font-lock-function-name-face)
                                (function :style "md" :icon "function" :face font-lock-function-name-face)
                                (module :style "md" :icon "file_send" :face font-lock-preprocessor-face)
                                (numeric :style "md" :icon "numeric" :face font-lock-builtin-face)
                                (operator :style "cod" :icon "symbol_operator" :face font-lock-comment-delimiter-face)
                                (param :style "md" :icon "code_parentheses" :face default)
                                (property :style "md" :icon "wrench" :face font-lock-variable-name-face)
                                (reference :style "md" :icon "file_link" :face font-lock-variable-name-face)
                                (snippet :style "md" :icon "note_text" :face font-lock-string-face)
                                (string :style "md" :icon "code_string" :face font-lock-string-face)
                                (struct :style "md" :icon "new_box" :face font-lock-variable-name-face)
                                (text :style "md" :icon "format_text" :face font-lock-doc-face)
                                (typeparameter :style "md" :icon "format_list_bulleted" :face font-lock-type-face)
                                (type-parameter :style "md" :icon "format_list_bulleted" :face font-lock-type-face)
                                (unit :style "md" :icon "ruler" :face font-lock-constant-face)
                                (value :style "md" :icon "toy_brick" :face font-lock-builtin-face)
                                (variable :style "md" :icon "toy_brick_outline" :face font-lock-variable-name-face)
                                (t :style "md" :icon "code_tags" :face font-lock-variable-name-face)
                                ))
    :ensure t
    )

#+end_src

*** [[https://github.com/rainstormstudio/nerd-icons-dired][Dired]]

#+begin_src emacs-lisp

  (use-package nerd-icons-dired
    :vc (:url "https://github.com/rainstormstudio/nerd-icons-dired")
    :after nerd-icons
    :ensure t
    :hook
    (dired-mode . nerd-icons-dired-mode)
    )

#+end_src

*** Eshell
:PROPERTIES:
:CREDITS:  https://thanosapollo.org/posts/emacs-shells-video/
:END:

#+begin_src emacs-lisp

  (use-package esh-mode
    :defer t
    :config
    (defun thanos/eshell-git-info ()
  	"Return a string showing git information."
  	(when (eq (call-process "git" nil nil nil "rev-parse" "--is-inside-work-tree") 0)
  	  (let* ((branch-raw (shell-command-to-string "git rev-parse --abbrev-ref HEAD"))
  			 (branch (if (or (string-match-p "^fatal" branch-raw)
  							 (string-match-p "^error" branch-raw))
  						 "Unknown"
  					   (string-trim branch-raw))))
  		(concat (propertize "󰊢 " 'face 'nerd-icons-lred)
  				(propertize branch 'face 'nerd-icons-lred)))))
    (defun thanos/eshell-prompt-multiline ()
  	"Eshell Multiline Git prompt."
  	(let ((separator (propertize " | " 'face 'shadow))
  		  (dir (propertize (format "%s" (abbreviate-file-name (eshell/pwd))) 'face 'dired-directory))
  		  (git-info (thanos/eshell-git-info))
  		  (sign (if (= (user-uid) 0)
  					(propertize "\#" 'face 'default)
  				  (propertize (format "\n\nλ %s\n↳" user-login-name) 'face 'nerd-icons-lpurple))))
  	  (concat "\n" dir separator git-info sign " ")))
    :custom
    (eshell-banner-message "")
    (eshell-prompt-function 'thanos/eshell-prompt-multiline)
    )
#+end_src

*** Flymake

#+begin_src emacs-lisp

  (use-package emacs
    :custom
    (flymake-indicator-type 'margins)
    (flymake-margin-indicators-string '(
                                        (error "󰃤" compilation-error)
                                        (warning "" compilation-warning)
                                        (note "󰎚" compilation-info)
                                        ))
    )

#+end_src

*** Go

Use a Gopher for walrus operators (~:=~).

#+begin_src emacs-lisp

  (use-package go-ts-mode
    :after nerd-icons go-ts-mode
    :hook
    (go-ts-mode . prettify-symbols-mode)
    (go-ts-mode . (lambda ()
                    (push '(":=" . ?) prettify-symbols-alist)))
    )

#+end_src

*** Rust

Use Ferris for match arms.

#+begin_src emacs-lisp

  (use-package rust-ts-mode
    :after nerd-icons rust-ts-mode
    :hook
    (rust-ts-mode . prettify-symbols-mode)
    (rust-ts-mode . (lambda ()
                      (push '("=>" . ?) prettify-symbols-alist)))
    )

#+end_src

*** [[https://github.com/seagle0128/nerd-icons-ibuffer][iBuffer]]

#+begin_src emacs-lisp

  (use-package nerd-icons-ibuffer
    :vc (:url "https://github.com/seagle0128/nerd-icons-ibuffer")
    :after nerd-icons
    :ensure t
    :hook
    (ibuffer-mode . nerd-icons-ibuffer-mode)
    )

#+end_src

*** [[https://github.com/gekoke/magit-file-icons][Magit]]

#+begin_src emacs-lisp

  (use-package magit-file-icons
    :vc (:url "https://github.com/gekoke/magit-file-icons")
    :after nerd-icons magit
    :ensure t
    :hook
    (magit-mode . magit-file-icons-mode)
    )

#+end_src

** [[https://github.com/alphapapa/prism.el][Prism]]
:PROPERTIES:
:CUSTOM_ID: prism
:END:

#+begin_quote

Disperse Lisp forms (and other languages) into a spectrum of colors by depth.

#+end_quote


#+begin_src emacs-lisp

  (use-package prism
    :vc (:url "https://github.com/alphapapa/prism.el")
    :config
    (defun gs-101/prism-mode-lisp ()
      "Enable `prism-mode' in Lisp modes."
      (when (string-match-p "clojure.*-mode\\'" (symbol-name major-mode))
        (prism-mode))
      (when (string-match-p "lisp.*-mode\\'" (symbol-name major-mode))
        (prism-mode))
      (when (derived-mode-p 'scheme-mode)
        (prism-mode)))
    :ensure t
    :hook
    (prog-mode . gs-101/prism-mode-lisp)
    (python-base-mode . prism-whitespace-mode)
    )

#+end_src

*** Catppuccin Colors

#+begin_src emacs-lisp

  (use-package prism
    :after prism catppuccin-theme
    :config
    (defun prism-catppuccin-colors ()
      "Grab color definitions from catppuccin and use them to set prism's colors."
      (prism-set-colors
        :lightens '(0 5 10)
        :desaturations '(-2.5 0 2.5)
        :colors (-map #'catppuccin-get-color '(
                                               red
                                               peach
                                               yellow
                                               green
                                               sapphire
                                               lavender
                                               mauve
                                               ))))
    (prism-catppuccin-colors)
    )

#+end_src

**** Daemon Support

#+begin_src emacs-lisp

  (use-package prism
    :if (daemonp)
    :after prism catppuccin-theme
    :config
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (with-selected-frame frame
                (prism-catppuccin-colors))))
    )

#+end_src

