emacs.org
** [[https://github.com/Fanael/rainbow-delimiters][Rainbow Delimiters]]

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :vc (:url "https://github.com/Fanael/rainbow-delimiters")
    :config
    (defun gs-101/rainbow-delimiters-maybe ()
      "Enable `rainbow-delimiters-mode' only in non-lisp modes.

  This is because I find `prism-mode' better for these modes.

  Also disable in Python because I use `prism-whitespace-mode' there."
      (unless (or
               (string-match-p "clojure.*-mode\\'" (symbol-name major-mode))
               (string-match-p "lisp.*-mode\\'" (symbol-name major-mode))
               (derived-mode-p 'scheme-mode)
               (derived-mode-p 'python-base-mode))
        (rainbow-delimiters-mode)))
    :ensure t
    :hook
    (prog-mode . gs-101/rainbow-delimiters-maybe)
    )

#+end_src

** [[https://github.com/tumashu/posframe][posframe]]

#+begin_quote

Pop a posframe (just a child-frame) at point.

#+end_quote

#+begin_src emacs-lisp

  (use-package posframe
    :vc (:url "https://github.com/tumashu/posframe")
    :ensure t
    )

#+end_src

*** [[https://github.com/yanghaoxie/transient-posframe/pull/7#issuecomment-2538792470][Transient]]

#+begin_src emacs-lisp

  (use-package posframe
    :after transient
    :custom
    (transient-display-buffer-action
     (list
      (lambda (buffer _)
        (posframe-show
         buffer
         :poshandler #'posframe-poshandler-frame-center
         :min-width transient-minimal-frame-width ;; Use the same minimal width as transient, to avoid weird resizing
         :lines-truncate t ;; Truncate lines instead of wrapping them
         :internal-border-color (transient--prefix-color) ;; Use transient colors to indicate that the current frame is a transient
         :internal-border-width 1)
        (get-buffer-window transient--buffer t))))
    )

#+end_src

*** [[https://github.com/tumashu/vertico-posframe][Vertico]]

#+begin_src emacs-lisp

  (use-package vertico-posframe
    :vc (:url "https://github.com/tumashu/vertico-posframe")
    :after vertico
    :ensure t
    :custom
    (vertico-posframe-border-width 1)
    :config
    (vertico-posframe-mode)
    )

#+end_src

** End

#+begin_src emacs-lisp

  (provide 'gs-ui)
#+end_src

* Local Variables

# Local Variables:
# eval: (add-hook 'after-save-hook #'org-babel-tangle t t)
# End:
